# Numpy

### Task 1

In [3]:
import numpy as np

In [13]:
a = np.transpose(np.array([[1, 2, 3, 3, 1],
                           [6, 8, 11, 10, 7]]))
print(a)
mean_a = a.mean(axis=0)
print(f'Средние значения по признаку: {mean_a}')

[[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]
Средние значения по признаку: [2.  8.4]

### Task 2

In [58]:
a_centered = a - mean_a
print(a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

### Task 3

In [21]:
a_centered_sp = np.dot(a_centered[:,0], a_centered[:,1])
print(f'Скалярное произведение столбцов массива a_centered: {a_centered_sp}')
N = a_centered.shape[0]
print(f'Ковариация 2х признаков: {a_centered_sp/(N-1)}')

Скалярное произведение столбцов массива a_centered: 8.0
Ковариация 2х признаков: 2.0

### Task 4

In [26]:
print(f'Ковариация 2х признаков другим способом:{np.cov(a.transpose())[0,1]}')

Ковариация 2х признаков другим способом:2.0

# Pandas

### Task 1

In [29]:
import pandas as pd

In [56]:
authors = pd.DataFrame({
    "author_id": [1, 2, 3],
    "author_name": ['Тургенев', 'Чехов', 'Островский']
})
book = pd.DataFrame({
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price": [450, 300, 350, 500, 450, 370, 290]
})
authors
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Task 2

In [69]:
authors_price = pd.merge(authors, book, on='author_id', how='outer')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Task 3

In [54]:
top5 = authors_price.nlargest(5, "price")
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### Task 4

In [53]:
min_price = authors_price.groupby("author_name").agg({"price": "min"}).rename(columns={'price':'min_price'})
max_price = authors_price.groupby("author_name").agg({"price": "max"}).rename(columns={'price':'max_price'})
mean_price = authors_price.groupby("author_name").agg({"price": "mean"}).rename(columns={'price':'mean_price'})
authors_stat = pd.concat([min_price, max_price, mean_price], axis = 1)

authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

### Task 5

In [70]:
cover = pd.DataFrame({"cover": ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']})
authors_price = pd.concat([authors_price, cover], axis = 1)

authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [75]:
book_info = pd.pivot_table(authors_price, values='price', index=['author_name'], columns=['cover'], aggfunc=np.sum, fill_value=0)

book_info

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [81]:
book_info.to_pickle("book_info.pkl")
book_info_read = pd.read_pickle('book_info.pkl')

book_info_read

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [82]:
book_info.equals(book_info_read)

True